"""

[Variables 변수]

자료를 그릇에 담아서 보관, 사용하면 편리하다. 이를 변수라고 부른다.

변수이름 사용 방법

변수 이름 = 자료

등호기호는 같다의 의미가 아닌 대입의 의미이다.

"""

num = 10 #숫자

name = " Chris from Germanny" # 문자열

grade = ['A+', 'B+', 'AO'] #리스트

"""

변수의 이름 짓는 방법 

숫자, 알파벳, 한글, 언더바(_)등을 사용 할 수 있다.


그러나

1. 변수 이름이 숫자로만 시작하면 안된다.
2. 숫자로만 구성된 변수 이름 금지
3. 파이썬 문법애서 사용되는 예약어 금지(ex: for, while, if 등)
4. 공백문자()와 연산자는 사용 금지

"""

#변수 연습

# 변수에는 정수, 실수같은 숫자를 저장할 수 있고,
num1 = 1
num2 = 2 
# 영어나 한글같은 문자도 저장할 수 있어요.
character = 'a'

# 이런 문자들의 집합도 저장할 수 있고,
string = 'Python'

# 자료들을 여러 개 담을 수 있는 리스트 또한 저장할 수 있어요.
threeList = [1, 'a', 'Python']

# 여러분의 변수를 만들어 봅시다. my_var라는 이름의 변수를 만들고, 원하는 값을 넣어보세요!
my_var = 'Dahee'

# 변수는 print()에 넣을 수도 있어요! my_var를 print로 출력해서 값이 잘 들어갔는지 확인해봅시다!
print(my_var)

# 변수끼리는 연산 또한 가능합니다. 예를들어, 위에 있는 num1, num2을 더하면?!
print(num1+num2)





