"""
Python은 IT 지원, 시스템 관리, 웹 개발, 기계 학습, 데이터 분석 등 IT 분야에서 널리 사용됩니다. Python은 통계 계산, 전자 상거래 사이트 실행, 이미지 처리, 웹 서비스 상호 작용 및 기타 다양한 작업을 수행하는 데 사용할 수 있습니다. Python 명령어는 영어와 유사하므로 다른 프로그래밍 언어에 비해 배우고 이해하기가 더 쉽습니다.

1. 파이썬은 다음과 같습니다

1). 범용 스크립팅 언어;

2). 다양한 애플리케이션을 코딩하는 데 사용되는 인기 있는 언어입니다.

3). 자동화를 위해 자주 사용되는 도구입니다.

4). 크로스 플랫폼 호환 언어;

5). 초보자에게 친숙한 언어.


2. 파이썬은 그렇지 않습니다

1). 플랫폼별/OS별 스크립팅 언어

2). 클라이언트 측 스크립팅 언어;

3). 순수한 객체 지향 프로그래밍 언어입니다.


Python과 코드 비교

이 프로그램에서는 Python과 Bash 스크립팅에 대해 배우게 됩니다. 다음 코드는 두 언어 간의 구문 차이를 보여줍니다.

Python에서 화면으로 인쇄  

>> print("안녕하세요, 잘 지내세요?")

안녕하세요. 어떻게 지내세요?


Bash에서 화면으로 인쇄  

>> echo 안녕하세요, 잘 지내세요?

안녕하세요. 어떻게 지내세요?


핵심 용어

플랫폼별/OS별 스크립팅 언어 - PowerShell(Windows용) 및 Bash(Linux용)와 같은 플랫폼별 스크립팅 언어는 해당 플랫폼의 시스템 관리자가 사용합니다. 

클라이언트 측 스크립팅 언어 - JavaScript와 같은 클라이언트 측 스크립팅 언어는 주로 웹 프로그래밍에 사용됩니다. 스크립트는 웹 서버에서 최종 사용자의 인터넷 브라우저로 전송된 다음 브라우저에서 실행됩니다.

기계어 - 기계어는 가장 낮은 수준의 컴퓨터 언어입니다. 이진 코드(1과 0)로 컴퓨팅 기계와 직접 통신합니다. 이진 코드에서 1은 전기 펄스와 같고 0은 전기 펄스가 없는 것과 같습니다. 기계어 명령어는 Python과 같은 언어를 1과 0의 복잡한 패턴으로 번역하여 만들어집니다. 

크로스 플랫폼 언어 - 하나 이상의 플랫폼/운영 체제(예: Windows, Linux, Mac, iOS, Android)와 호환되는 프로그래밍 언어입니다. 

객체 지향 프로그래밍 언어 - 객체 지향 프로그래밍 언어에서 대부분의 코딩 요소는 구성 가능한 속성을 가진 객체로 간주됩니다. 예를 들어 양식 필드는 mm/dd/yy 형식의 입력으로 날짜만 허용하도록 구성할 수 있고 특정 데이터베이스에서 읽고 쓰도록 구성할 수 있는 개체입니다. 

Python 인터프리터 - 인터프리터는 Python 코드를 컴퓨터 명령어로 변환하여 Python 코드를 읽고 실행하는 프로그램입니다.

"""