# Syntax for printing a string of text. Click Run to check the result.

print("Hello world!")

"""

키워드는 특정 목적을 수행하는 프로그래밍 언어의 예약어입니다.

값: True , False , 없음
조건: if , elif , else
논리 연산자: and , or , not
루프: for , in , while , break , continue
함수: def , return  

산술 연산자
Python은 일부 특수 연산자와 함께 일반적인 수학 연산자를 사용하여 숫자를 계산할 수 있습니다.  

x + y            더하기 + 연산자는 x 더하기 y의 합을 반환합니다.

x - y              빼기 - 연산자는 x 빼기 y의 차이를 반환합니다.

x * y             곱셈 * 연산자는 x곱하기 y의 곱을 반환합니다 . 

x / y              나누기 / 연산자는 x의 몫을 반환합니다. y로 나눈 값

x**e             지수 ** 연산자는 x를 e의 거듭제곱으로 올린 결과를 반환합니다. 

x**2             제곱 표현식은 x 제곱을 반환합니다.

x **3             큐브 표현식은 x의 제곱을 반환합니다.

x**(1/2) 제곱근 (½) 또는 (0.5) 분수 지수 연산자는 x x의 제곱근을 반환합니다.

// y            바닥 나누기 연산자는 x를 y로 나눈 정수 부분을 반환합니다.

x % y           모듈로 연산자는 x의 정수 나누기의 나머지 부분을 반환합니다. y로


작업 순서
작업 순서는 다음 순서에 따라 왼쪽에서 오른쪽으로 계산됩니다. 

괄호 ( ), { }, [ ]

지수 x e (    x**e)

곱셈 * 및 나눗셈 /  

덧셈 + 뺄셈 -    

PEMDAS 니모닉 장치가 순서를 기억하는 데 도움이 될 수 있습니다 .


"""