"""
1. Python의 함수란 무엇입니까?

함수를 사용하면 Python을 계산기로 사용할 수 있습니다.

함수는 작업 단위를 수행하는 코드 조각입니다. V

함수는 화면에 메시지를 인쇄하는 데에만 사용됩니다.

함수는 프로그램이 작동하는지 여부를 알려주는 방법입니다.



2.Python의 키워드는 무엇입니까?

키워드는 명령어를 구성하는 데 사용되는 예약어입니다. V

키워드는 수학 연산을 계산하는 데 사용됩니다.

키워드는 "Hello World!"와 같은 메시지를 인쇄하는 데 사용됩니다. 화면에.

키워드는 Python에서 프로그래밍을 하기 위해 외워야 하는 단어입니다.



3.Python에서 인쇄 기능은 무엇을 합니까?

인쇄 기능은 PDF를 생성하여 가장 가까운 프린터로 보냅니다.

인쇄 기능은 사용자가 제공한 값을 저장합니다.

인쇄 기능은 메시지를 화면에 출력합니다.V

인쇄 기능은 수학 연산을 계산합니다.

"""